Repository: Ovid/sqlitch
Catalog: sqlitch/i18n/locale/*/LC_MESSAGES/sqlitch.po
Languages: de_de, fr_fr, it_it

source: Cannot find your name; run sqlitch config --user user.name "YOUR NAME"
de_de: Kann deinen Namen nicht finden. Führe den folgenden Befehl aus: sqlitch config --user user.name "DEIN NAME"
fr_fr: Impossible de trouver votre nom ; exécutez sqlitch config --user user.name "VOTRE NOM"
it_it: Impossibile trovare il tuo nome; esegui sqlitch config --user user.name "IL TUO NOME"

source: Cannot infer your email address; run sqlitch config --user user.email you@host.com
de_de: Kann deine E-Mail-Adresse nicht finden. Führe den folgenden Befehl aus: sqlitch config --user user.email dein.name@domain.com
fr_fr: Impossible de déduire votre adresse e-mail ; exécutez sqlitch config --user user.email vous@hote.com
it_it: Impossibile dedurre il tuo indirizzo email; esegui sqlitch config --user user.email tu@host.com

source: Cannot change to directory {directory}: {error}
de_de: Konnte nicht in das folgende Verzeichnis wechseln {directory}: {error}
fr_fr: Impossible de changer vers le répertoire {directory} : {error}
it_it: Impossibile cambiare alla directory {directory}: {error}

source: "{command}" is not a valid command
de_de: "{command}" ist ein ungültiger Befehl
fr_fr: "{command}" n'est pas une commande valide
it_it: "{command}" non è un comando valido

source: Sqlitch seems to be unattended and there is no default value for this question
de_de: Sqlitch scheint unbeaufsichtigt ausgeführt zu werden, und es steht leider kein Standardwert für diese Frage zur Verfügung
fr_fr: Sqlitch semble être en mode non supervisé et il n'y a pas de valeur par défaut pour cette question
it_it: Sqlitch sembra essere in modalità non supervisionata e non c'è un valore predefinito per questa domanda

# Confirm prompt answer yes
source: Yes
de_de: Ja
fr_fr: Oui
it_it: Sì

source: No engine specified; specify via target or core.engine
de_de: Keine Engine angegeben; gib sie über target oder core.engine an
fr_fr: Aucun moteur spécifié ; spécifiez via target ou core.engine
it_it: Nessun motore specificato; specifica tramite target o core.engine

source: Unknown engine: {engine}
de_de: Unbekannte Engine: {engine}
fr_fr: Moteur inconnu : {engine}
it_it: Motore sconosciuto: {engine}

source: {driver} required to manage {engine}
de_de: {driver} wird benötigt, um {engine} zu verwalten
fr_fr: {driver} requis pour gérer {engine}
it_it: {driver} richiesto per gestire {engine}

source: Sqitch database {database} already initialized
de_de: Sqitch-Datenbank {database} bereits initialisiert
fr_fr: Base de données Sqitch {database} déjà initialisée
it_it: Database Sqitch {database} già inizializzato

source: Sqitch schema "{schema}" already exists
de_de: Sqitch-Schema "{schema}" existiert bereits
fr_fr: Le schéma Sqitch "{schema}" existe déjà
it_it: Lo schema Sqitch "{schema}" esiste già

source: Unknown change: "{change}"
de_de: Unbekannte Änderung: "{change}"
fr_fr: Changement inconnu : "{change}"
it_it: Modifica sconosciuta: "{change}"

source: Change not deployed: "{change}"
de_de: Änderung nicht bereitgestellt: "{change}"
fr_fr: Changement non déployé : "{change}"
it_it: Modifica non distribuita: "{change}"

source: Nothing to deploy (already at "{change}")
de_de: Nichts bereitzustellen (bereits bei "{change}")
fr_fr: Rien à déployer (déjà à "{change}")
it_it: Niente da distribuire (già a "{change}")

source: Deploying changes through {change} to {destination}
de_de: Stelle Änderungen bis {change} auf {destination} bereit
fr_fr: Déploiement des changements jusqu'à {change} vers {destination}
it_it: Distribuzione delle modifiche fino a {change} verso {destination}

source: Deploying changes to {destination}
de_de: Stelle Änderungen auf {destination} bereit
fr_fr: Déploiement des changements vers {destination}
it_it: Distribuzione delle modifiche verso {destination}

source: Reverting changes to {change} from {destination}
de_de: Setze Änderungen auf {change} von {destination} zurück
fr_fr: Annulation des changements vers {change} depuis {destination}
it_it: Ripristino delle modifiche a {change} da {destination}

source: Reverting all changes from {destination}
de_de: Setze alle Änderungen von {destination} zurück
fr_fr: Annulation de tous les changements depuis {destination}
it_it: Ripristino di tutte le modifiche da {destination}

source: Revert changes to {change} from {destination}?
de_de: Änderungen auf {change} von {destination} zurücksetzen?
fr_fr: Annuler les changements vers {change} depuis {destination} ?
it_it: Ripristinare le modifiche a {change} da {destination}?

source: Revert all changes from {destination}?
de_de: Alle Änderungen von {destination} zurücksetzen?
fr_fr: Annuler tous les changements depuis {destination} ?
it_it: Ripristinare tutte le modifiche da {destination}?

source: Nothing reverted
de_de: Nichts zurückgesetzt
fr_fr: Rien d'annulé
it_it: Niente ripristinato

source: Verifying {destination}
de_de: Überprüfe {destination}
fr_fr: Vérification de {destination}
it_it: Verifica di {destination}

source: Change "{change}" has not been deployed
de_de: Änderung "{change}" wurde nicht bereitgestellt
fr_fr: Le changement "{change}" n'a pas été déployé
it_it: La modifica "{change}" non è stata distribuita

source: Cannot find "{change}" in the database or the plan
de_de: Kann "{change}" weder in der Datenbank noch im Plan finden
fr_fr: Impossible de trouver "{change}" dans la base de données ou le plan
it_it: Impossibile trovare "{change}" nel database o nel piano

source: Change "{change}" is deployed, but not planned
de_de: Änderung "{change}" ist bereitgestellt, aber nicht geplant
fr_fr: Le changement "{change}" est déployé, mais pas planifié
it_it: La modifica "{change}" è distribuita, ma non pianificata

source: Verify script "{script}" failed.
de_de: Überprüfungsskript "{script}" fehlgeschlagen.
fr_fr: Le script de vérification "{script}" a échoué.
it_it: Lo script di verifica "{script}" è fallito.

source: Verify script {file} does not exist
de_de: Überprüfungsskript {file} existiert nicht
fr_fr: Le script de vérification {file} n'existe pas
it_it: Lo script di verifica {file} non esiste

source: Deploy script {file} does not exist
de_de: Bereitstellungsskript {file} existiert nicht
fr_fr: Le script de déploiement {file} n'existe pas
it_it: Lo script di distribuzione {file} non esiste

source: Revert script {file} does not exist
de_de: Zurücksetzungsskript {file} existiert nicht
fr_fr: Le script d'annulation {file} n'existe pas
it_it: Lo script di ripristino {file} non esiste

source: Could not determine home directory
de_de: Konnte das Home-Verzeichnis nicht bestimmen
fr_fr: Impossible de déterminer le répertoire personnel
it_it: Impossibile determinare la directory home

source: Cannot overwrite multiple values with a single value
de_de: Kann mehrere Werte nicht mit einem einzigen Wert überschreiben
fr_fr: Impossible d'écraser plusieurs valeurs avec une seule valeur
it_it: Impossibile sovrascrivere più valori con un singolo valore

source: Cannot unset key with multiple values
de_de: Kann Schlüssel mit mehreren Werten nicht zurücksetzen
fr_fr: Impossible de désactiver une clé avec plusieurs valeurs
it_it: Impossibile annullare la chiave con più valori

source: Registry
fr_fr: Registre
it_it: Registro

source: Top Directory
de_de: Hauptverzeichnis
fr_fr: Répertoire Principal
it_it: Directory Principale

source: Plan File
de_de: Plan-Datei
fr_fr: Fichier de Plan
it_it: File di Piano

source: Extension
de_de: Erweiterung
it_it: Estensione

source: Deploy
de_de: Bereitstellen
fr_fr: Déployer
it_it: Distribuisci

source: Revert
de_de: Zurücksetzen
fr_fr: Annuler
it_it: Ripristina

source: Script Directories
de_de: Skript-Verzeichnisse
fr_fr: Répertoires de Scripts
it_it: Directory degli Script

source: Reworked Script Directories
de_de: Überarbeitete Skript-Verzeichnisse
fr_fr: Répertoires de Scripts Retravaillés
it_it: Directory degli Script Rielaborati

source: Variables
de_de: Variablen
it_it: Variabili

source: No Variables
de_de: Keine Variablen
fr_fr: Aucune Variable
it_it: Nessuna Variabile

source: On database {destination}
de_de: Auf Datenbank {destination}
fr_fr: Sur la base de données {destination}
it_it: Sul database {destination}

source: Project: {project}
de_de: Projekt: {project}
fr_fr: Projet : {project}
it_it: Progetto: {project}

source: Change: {change}
de_de: Änderung: {change}
fr_fr: Changement : {change}
it_it: Modifica: {change}

source: Name: {name}
fr_fr: Nom : {name}
it_it: Nome: {name}

source: Deployed: {date}
de_de: Bereitgestellt: {date}
fr_fr: Déployé : {date}
it_it: Distribuito: {date}

source: By: {name} <{email}>
de_de: Von: {name} <{email}>
fr_fr: Par : {name} <{email}>
it_it: Da: {name} <{email}>

source: Invalid dependency: {dependency}
de_de: Ungültige Abhängigkeit: {dependency}
fr_fr: Dépendance invalide : {dependency}
it_it: Dipendenza non valida: {dependency}

source: Change "{change}" is ambiguous. Please specify a tag-qualified change:
de_de: Änderung "{change}" ist mehrdeutig. Bitte gib eine tag-qualifizierte Änderung an:
fr_fr: Le changement "{change}" est ambigu. Veuillez spécifier un changement qualifié par tag :
it_it: La modifica "{change}" è ambigua. Specifica una modifica qualificata da tag:

source: Reverting to {change}
de_de: Setze auf {change} zurück
fr_fr: Annulation vers {change}
it_it: Ripristino a {change}

source: Reverting all changes
de_de: Setze alle Änderungen zurück
fr_fr: Annulation de tous les changements
it_it: Ripristino di tutte le modifiche

source: Cannot remove {file}: {error}
de_de: Kann {file} nicht entfernen: {error}
fr_fr: Impossible de supprimer {file} : {error}
it_it: Impossibile rimuovere {file}: {error}

source: Cannot copy {file} to {alias}: {error}
de_de: Kann {file} nicht nach {alias} kopieren: {error}
fr_fr: Impossible de copier {file} vers {alias} : {error}
it_it: Impossibile copiare {file} in {alias}: {error}

source: Cannot symlink {file} to {alias}: {error}
de_de: Kann {file} nicht mit {alias} verknüpfen: {error}
fr_fr: Impossible de créer un lien symbolique de {file} vers {alias} : {error}
it_it: Impossibile creare un collegamento simbolico da {file} a {alias}: {error}

source: Cannot open {file}: {error}
de_de: Kann {file} nicht öffnen: {error}
fr_fr: Impossible d'ouvrir {file} : {error}
it_it: Impossibile aprire {file}: {error}

source: Sqitch requires {rdbms} {want_version} or higher; this is {have_version}
de_de: Sqitch benötigt {rdbms} {want_version} oder höher; dies ist {have_version}
fr_fr: Sqitch nécessite {rdbms} {want_version} ou supérieur ; ceci est {have_version}
it_it: Sqitch richiede {rdbms} {want_version} o superiore; questo è {have_version}

source: Sqitch requires SQLite 3.8.6 or later; DBD::SQLite was built with {version}
de_de: Sqitch benötigt SQLite 3.8.6 oder später; DBD::SQLite wurde mit {version} erstellt
fr_fr: Sqitch nécessite SQLite 3.8.6 ou ultérieur ; DBD::SQLite a été construit avec {version}
it_it: Sqitch richiede SQLite 3.8.6 o successivo; DBD::SQLite è stato costruito con {version}

source: Sqitch requires SQLite 3.3.9 or later; {client} is {version}
de_de: Sqitch benötigt SQLite 3.3.9 oder später; {client} ist {version}
fr_fr: Sqitch nécessite SQLite 3.3.9 ou ultérieur ; {client} est {version}
it_it: Sqitch richiede SQLite 3.3.9 o successivo; {client} è {version}

source: Database name missing in URI {uri}
de_de: Datenbankname fehlt in URI {uri}
fr_fr: Nom de base de données manquant dans l'URI {uri}
it_it: Nome del database mancante nell'URI {uri}

source: Cannot determine Snowflake account name
de_de: Kann Snowflake-Kontoname nicht bestimmen
fr_fr: Impossible de déterminer le nom de compte Snowflake
it_it: Impossibile determinare il nome dell'account Snowflake

source: Cannot specify both --all and engine, target, or plan arguments
de_de: Kann nicht sowohl --all als auch Engine-, Target- oder Plan-Argumente angeben
fr_fr: Impossible de spécifier à la fois --all et les arguments engine, target ou plan
it_it: Impossibile specificare sia --all che gli argomenti engine, target o plan

source: Cannot specify both --from or --to and change arguments
de_de: Kann nicht sowohl --from oder --to als auch Änderungsargumente angeben
fr_fr: Impossible de spécifier à la fois --from ou --to et les arguments de changement
it_it: Impossibile specificare sia --from o --to che gli argomenti di modifica

source: Use of --to or --from to bundle multiple targets is not recommended.\nPass them as arguments after each target argument, instead.
de_de: Die Verwendung von --to oder --from zum Bündeln mehrerer Ziele wird nicht empfohlen.\nÜbergib sie stattdessen als Argumente nach jedem Zielargument.
fr_fr: L'utilisation de --to ou --from pour regrouper plusieurs cibles n'est pas recommandée.\nPassez-les plutôt comme arguments après chaque argument de cible.
it_it: L'uso di --to o --from per raggruppare più target non è raccomandato.\nPassali invece come argomenti dopo ogni argomento target.

source: Missing required parameter $prompt_default
de_de: Fehlender erforderlicher Parameter $prompt_default
fr_fr: Paramètre requis manquant $prompt_default
it_it: Parametro richiesto mancante $prompt_default

source: No project configuration found. Run the "init" command to initialize a project
de_de: Keine Projektkonfiguration gefunden. Führe den "init"-Befehl aus, um ein Projekt zu initialisieren
fr_fr: Aucune configuration de projet trouvée. Exécutez la commande "init" pour initialiser un projet
it_it: Nessuna configurazione di progetto trovata. Esegui il comando "init" per inizializzare un progetto

source: Cannot unset an engine target
de_de: Kann ein Engine-Ziel nicht zurücksetzen
fr_fr: Impossible de désactiver une cible de moteur
it_it: Impossibile annullare un target del motore

source: Blocked by another instance of Sqlitch working on {dest}; waiting {secs} seconds...
de_de: Blockiert durch eine andere Instanz von Sqlitch, die an {dest} arbeitet; warte {secs} Sekunden...
fr_fr: Bloqué par une autre instance de Sqlitch travaillant sur {dest} ; attente de {secs} secondes...
it_it: Bloccato da un'altra istanza di Sqlitch che lavora su {dest}; attesa di {secs} secondi...

source: Timed out waiting for lock on {destination}
de_de: Zeitüberschreitung beim Warten auf Sperre für {destination}
fr_fr: Délai d'attente dépassé en attendant le verrou sur {destination}
it_it: Timeout nell'attesa del blocco su {destination}

source: Conflicts:
de_de: Konflikte:
fr_fr: Conflits :
it_it: Conflitti:

source: Adding registry tables to {destination}
de_de: Füge Registry-Tabellen zu {destination} hinzu
fr_fr: Ajout des tables de registre à {destination}
it_it: Aggiunta delle tabelle di registro a {destination}

source: No changes deployed since: "{change}"
de_de: Keine Änderungen bereitgestellt seit: "{change}"
fr_fr: Aucun changement déployé depuis : "{change}"
it_it: Nessuna modifica distribuita da: "{change}"

source: {command} unexpectedly failed; exit value = {exitval}
de_de: {command} unerwartet fehlgeschlagen; Exit-Wert = {exitval}
fr_fr: {command} a échoué de manière inattendue ; valeur de sortie = {exitval}
it_it: {command} è fallito inaspettatamente; valore di uscita = {exitval}

source: {command} unexpectedly returned exit value {exitval}
de_de: {command} gab unerwartet Exit-Wert {exitval} zurück
fr_fr: {command} a retourné de manière inattendue la valeur de sortie {exitval}
it_it: {command} ha restituito inaspettatamente il valore di uscita {exitval}

source: Unable to locate Firebird ISQL; set "engine.firebird.client" via sqlitch config
de_de: Kann Firebird ISQL nicht finden; setze "engine.firebird.client" über sqlitch config
fr_fr: Impossible de localiser Firebird ISQL ; définissez "engine.firebird.client" via sqlitch config
it_it: Impossibile localizzare Firebird ISQL; imposta "engine.firebird.client" tramite sqlitch config

source: Insufficient permissions to create the checkit() function; skipping.
de_de: Unzureichende Berechtigungen zum Erstellen der checkit()-Funktion; überspringe.
fr_fr: Permissions insuffisantes pour créer la fonction checkit() ; ignoré.
it_it: Permessi insufficienti per creare la funzione checkit(); saltato.

# Confirm prompt answer no
source: No
de_de: Nein
fr_fr: Non
